
![image](../Utilities/pandas_logo.png)

__Author: Christian Camilo Urcuqui LÃ³pez__

__Date: 14 August 2018__


# Pandas

The project Pandas is an open source library whose allows us to use data structures and data analysis for the Python language. The Panda's project url is https://pandas.pydata.org/

In this notebook we will see the essential functions to apply data analysis through the Pandas library in Python, moreover, we will see the first steps in an EDA (Exploratory Data Analysis) approach since how load the data that we will use and until how search insights through the information. 

This nootebok allows us to introduce in the data science world with Python, the content of the notebook is divided in the next sections:

- [Introduction](#Introduction)
- [Load data](#Load-data)
- [Exploration](#Exploration)
- [References](#References)

## Load data

We can have different situations in order to load the data to process in our data projects, such as, we can have the data in our local computer, we would like to load the data from an open repository by an specific URL, and the data are located in the cloud with some aditional steps to make in code (security and other activities related with the technnology).

Pandas has some methods to load the data in different shapes in a DataFrame 
We will use Iris dataset and the National Project, the data dictionaries can be found in these URLs:
+ https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.names
+ https://www.kaggle.com/nationalparkservice/park-biodiversity/data

In [4]:
import pandas as pd

# the next code will load the data but without the column names, so in the second line we can define them
#df = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data', header=None)
df = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data', 
                 header=None, names=["sepal_length","sepal_width", "petal_length","petal_width","class"])

# the idea with this dataset is to explore some elements through pandas that Iris does not provide, 
# such as categorical variables, specifically, the method provides with index_col to select what is the main column to identify
# each row
df_park = pd.read_csv('../datasets/parks.csv', index_col=['Park Code'], encoding='utf-8')

Another way to save the dataset in your repository or refresh it

In [65]:
import requests 
import csv
data = requests.get('')
with open("../datasets/name.csv", "w+") as f:
    writer = csv.writer(f)
    reader = csv.reader(data.text.splitlines())
    for row in reader:
        writer.writerow(row)

## Exploration

Know the datatypes for each column

In [37]:
df.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
class            object
dtype: object

Print the first three rows

In [40]:
df.head(3)

   sepal_length  sepal_width  petal_length  petal_width        class
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa

In [70]:
df_park.head(3)

                        Park Name State   Acres  Latitude  Longitude
Park Code
ACAD         Acadia National Park    ME   47390     44.35     -68.21
ARCH         Arches National Park    UT   76519     38.68    -109.57
BADL       Badlands National Park    SD  242756     43.75    -102.50

Get and print a specific row

In [41]:
df.iloc[0]

sepal_length            5.1
sepal_width             3.5
petal_length            1.4
petal_width             0.2
class           Iris-setosa
Name: 0, dtype: object

Get values through your dataframe's indexes:
+ loc() receives a string index or an array of string indexes
+ iloc() receives the position index or an array of position indexes (int)

In [80]:
print(df_park.loc["ACAD"])
print("")
print(df_park.loc[["ACAD","ARCH"]])
print("")
print(df_park.iloc[[1,2]])

Park Name    Acadia National Park
State                          ME
Acres                       47390
Latitude                    44.35
Longitude                  -68.21
Name: ACAD, dtype: object

                      Park Name State  Acres  Latitude  Longitude
Park Code
ACAD       Acadia National Park    ME  47390     44.35     -68.21
ARCH       Arches National Park    UT  76519     38.68    -109.57

                        Park Name State   Acres  Latitude  Longitude
Park Code
ARCH         Arches National Park    UT   76519     38.68    -109.57
BADL       Badlands National Park    SD  242756     43.75    -102.50

The next lines determine the number of rows and columns in the dataset, the specific number of rows and how get the column names.

In [89]:
print(df.shape)
print("")
print(len(df))
print("")
print(df_park.columns)
print("")
print(df.columns)

(150, 5)

150

Index(['Park Name', 'State', 'Acres', 'Latitude', 'Longitude'], dtype='object')

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width', 'class'], dtype='object')

Get the data by column name and the number of rows to display

In [94]:
print(df_park['State'][:2])
print("")
print(df['sepal_length'][:5])
print("")
#see how the columns are maped in the data_frame and how we can call it
print(df_park.Acres.head(2))

Park Code
ACAD    ME
ARCH    UT
Name: State, dtype: object

0    5.1
1    4.9
2    4.7
3    4.6
4    5.0
Name: sepal_length, dtype: float64

Park Code
ACAD    47390
ARCH    76519
Name: Acres, dtype: int64

In our dataset of parks the column "Park Name" has a space separator between the words, one recommendation is to have a simple words connected by a character, for example we will use _ in the next code:

In [5]:
df_park.columns = [col.replace(' ','_').lower() for col in df_park.columns]
print(df_park.columns)

Index(['park_name', 'state', 'acres', 'latitude', 'longitude'], dtype='object')

If you need a subset of your data we can use the above methods, for example

In [6]:
df_park[['state','acres']][:3]

          state   acres
Park Code
ACAD         ME   47390
ARCH         UT   76519
BADL         SD  242756

Get and print a specific value in a row and column

In [13]:
print(df_park.state.iloc[2]) # note again that you can call the column and next use iloc method
print("-----")
print(df_park.state.iloc[[2]]) # it is totally different from the previous example, note that you are printing the object propierties

SD
-----
Park Code
BADL    SD
Name: state, dtype: object

Filtering the data by conditions through the columns and the values in rows (Similar to R)

In [15]:
df_park[df_park.state == 'UT']

                            park_name state   acres  latitude  longitude
Park Code
ARCH             Arches National Park    UT   76519     38.68    -109.57
BRCA       Bryce Canyon National Park    UT   35835     37.57    -112.18
CANY        Canyonlands National Park    UT  337598     38.20    -109.93
CARE       Capitol Reef National Park    UT  241904     38.20    -111.17
ZION               Zion National Park    UT  146598     37.30    -113.05

Some logical operators are:

+ ~ it is "not"
+ | it is "or"
+ & it is "and"

In [16]:
df_park[(df_park.latitude > 60) | (df_park.acres > (10**6))].head(3)

,park_name,state,acres,latitude,longitude
Park Code,,,,,
DENA,Denali National Park and Preserve,AK,3372402,63.33,-150.50
DEVA,Death Valley National Park,"CA, NV",4740912,36.24,-116.82
EVER,Everglades National Park,FL,1508538,25.32,-80.93

Get a count of the unique values of a column

In [35]:
print(df_park.shape)
len(df_park.park_name.unique()) # it allows to know that each park is unique in our dataset

(56, 5)

56

### lambda

It is another important concept to apply in the searching process, it allows us to have more complex querys.

In [19]:
# the next code provides the park's names with a length of 3
df_park[df_park['park_name'].str.split().apply(lambda x: len(x) == 3)].head(3)

                        park_name state   acres  latitude  longitude
Park Code
ACAD         Acadia National Park    ME   47390     44.35     -68.21
ARCH         Arches National Park    UT   76519     38.68    -109.57
BADL       Badlands National Park    SD  242756     43.75    -102.50

### Get only a dataframe without NA's

In a exploratory data analysis is important to know the rows that have non values, the aim is to explore what happened during the capture process and what will do to resolve it. two methods to help us are:

+ isin, https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.isin.html
+ isnull, https://pandas.pydata.org/pandas-docs/stable/generated/pandas.isnull.html

In [28]:
print("data without non values in state feature")
print(df_park[df_park.state.isin(["WA","OR","CA"])].head())
print("")
print("data with non values")
print("")
print(df_park.isna().head())

data without non values in state feature
                               park_name state   acres  latitude  longitude
Park Code
CHIS       Channel Islands National Park    CA  249561     34.01    -119.42
CRLA           Crater Lake National Park    OR  183224     42.94    -122.10
JOTR           Joshua Tree National Park    CA  789745     33.79    -115.90
LAVO       Lassen Volcanic National Park    CA  106372     40.49    -121.51
MORA         Mount Rainier National Park    WA  235625     46.85    -121.75

data with non values

           park_name  state  acres  latitude  longitude
Park Code
ACAD           False  False  False     False      False
ARCH           False  False  False     False      False
BADL           False  False  False     False      False
BIBE           False  False  False     False      False
BISC           False  False  False     False      False

## References

+ https://www.kaggle.com/sohier/tutorial-accessing-data-with-pandas/
+ http://wavedatalab.github.io/datawithpython/munge.html